Revit 2024 API
Viewport.ViewportPositioning Property
 Specifies the method the viewport will be positioned on the sheet when swapped to another view. Default is set to ViewportPositioning::ViewportCenter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public ViewportPositioning ViewportPositioning { get; set; }
Visual Basic
Public Property ViewportPositioning As ViewportPositioning
	Get
	Set
Visual C++
public:
property ViewportPositioning ViewportPositioning {
	ViewportPositioning get ();
	void set (ViewportPositioning value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Viewport Class
Autodesk.Revit.DB Namespace